package weather.model.weather.enumeration;

/**
 * Created with IntelliJ IDEA.
 * User: gcherkasov
 * Date: 20.11.14
 * Time: 10:49
 * To change this template use File | Settings | File Templates.
 */
public enum Phenomen {
    RA, //Дождь
    FZRA, //Переохлаждённый дождь
    PL, //Гололёд(Ледяной дождь)
    SN, //Снег
    RASN, //Дождь со снегом
    SNRA, //Снег c дождем
    DZ, //Морось с дождём
    FZDZ, //Переохлаждённая морось
    SG, //Снежные зёрна
    SHRA, //Ливневой дождь
    SHSN, //Ливневой снег
    SHSNRA, //Ливневой дождь со снегом
    GS, //Снежная (ледяная) крупа
    SHGR, //Град
    TSRA, //Гроза с дождём
    TSGR, //Гроза с градом
    TSGS, //Гроза со снежной крупой
    TSSN, //Гроза со снегом
    TSPL, //Гроза с ледяным дождём
    IC, //Ледяные иглы
    IE, //Гололедица
    BR, //Дымка
    MIFG, //Поземный туман
    PRFG, //Просвечивающий туман
    FG, //Туман
    VCFG, //Туман в окрестности
    FZFG, //Переохлаждённый туман
    BCFG, //Туман местами
    DRSN, //Позёмок
    BLSN, //Метель
    HZSN, //Снежная мгла
    DRSA, //Песчаный позёмок
    DRDU, //Пыльный позёмок
    DS, //Пыльная буря
    SS, //Песчаная буря
    DU, //Пыль (взвешенная в воздухе), пыльная мгла
    FU, //Дым
    HZ, //Мгла
    BLDU, //Пыльная низовая метель
    SQ, //Шквал
    FC, //Смерч (торнадо)
    TS, //Гроза без осадков
    NO //Нет явлений
}
